/* 
  SBXErrors.strings
  Secrets

  Created by Paulo Andrade on 9/25/12.

*/

"UnexpectedError.errorDescription" = "Erreur inattendue";
"UnexpectedError.failureReason" = "Nous sommes désolés, l'opération a échoué à cause d'une erreur inattendue. Veuillez contacter l'assistance si le problème persiste.";

"ModelInvalidProperty.errorDescription" = "Valeur invalide";
"ModelInvalidProperty.failureReason" = "A %@ %@ must be a %@";

"DataStoreIncompatibleMasterKeyError.errorDescription" = "Clé maîtresse incompatible";
"DataStoreIncompatibleMasterKeyError.failureReason" = "La validation de la clé maîtresse de ce document a échoué.";

"DataStoreMustBeUnlockedError.errorDescription" = "Stockage de données verrouillé";
"DataStoreMustBeUnlockedError.failureReason" = "Le stockage de données doit être déverrouillé pour effectuer cette opération.";

"DataStoreNotPassphraseProtectedError.errorDescription" = "Stockage de données non protégé";
"DataStoreNotPassphraseProtectedError.failureReason" = "Le stockage de données n'est pas encore protégé par une phrase secrète.";

"DataStoreCorruptedError.errorDescription" = "Le document est invalide";
"DataStoreCorruptedError.failureReason" = "Impossible d'ouvrir le document, il est peut-être corrompu.";

"DataStoreURLNotSetError.errorDescription" = "URL du stockage non configuré";
"DataStoreURLNotSetError.failureReason" = "L'URL du stockage doit être configuré avant d'effectuer cette opération";

"DataStoreSynchronizationFailedError.errorDescription" = "Synchronisation échouée";
"DataStoreSynchronizationFailedError.failureReason" = "Synchronisation échouée à cause d'une erreur inattendue.";

"DataStoreIncorrectPassphraseError.errorDescription" = "Phrase secrète incorrecte";
"DataStoreIncorrectPassphraseError.failureReason" = "Le déverrouillage du stockage de données avec la phrase secrète fournie a échoué.";

"DataStoreMigrationUnknownModelError.errorDescription" = "Mise à jour requise";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets.
*/
"DataStoreMigrationUnknownModelError.failureReason" = "Il semble que vos données aient été enregistrées avec une version plus récente de %@.";
/*
 * The %@ will be replaced by the application name. Example:
 * It seems your data was saved using a more recent version of Secrets. Please update to the latest version and try again.
*/
"DataStoreMigrationUnknownModelError.recoverySuggestion" = "Il semble que vos données aient été enregistrées avec une version plus récente de %@. Veuillez mettre à jour vers la dernière version et réessayer.";

"DataStoreMigrationSourceMetadataError.errorDescription" = "Format de fichier inconnu";
"DataStoreMigrationSourceMetadataError.failureReason" = "Échec de l'identification du format de fichier";

"NetworkConnectionVersionMismatchError.errorDescription" = "Non-concordance des versions";
"NetworkConnectionVersionMismatchError.failureReason" = "L'appareil auquel vous tentez de vous connecter fait fonctionner une version incompatible. Veuillez-vous assurer que votre logiciel est à jour.";

"NetworkConnectionInterruptedError.errorDescription" = "Connexion échouée";
"NetworkConnectionInterruptedError.failureReason" = "La connexion a été interrompue pour une raison inconnue.";

"NetworkConnectionBadRequestError.errorDescription" = "Connexion échouée";
"NetworkConnectionBadRequestError.failureReason" = "La connexion a été interrompue à cause d'une mauvaise requête.";

"NetworkConnectionInternalError.errorDescription" = "Connexion échouée";
"NetworkConnectionInternalError.failureReason" = "Connexion échouée à cause d'une erreur interne";

"NetworkConnectionUnauthorizedRequestError.errorDescription" = "Connexion échouée";
"NetworkConnectionUnauthorizedRequestError.failureReason" = "La connexion a été interrompue à cause d'une requête non autorisée.";

"NetworkConnectionFailedError.errorDescription" = "Connexion échouée";
"NetworkConnectionFailedError.failureReason" = "L'établissement d'une connexion avec un pair a échoué. Veuillez vérifier les réglages du WiFi et du Bluetooth.";

"NetworkConnectionTimedOutError.errorDescription" = "Délai de connexion dépassé";
"NetworkConnectionTimedOutError.failureReason" = "L'établissement d'une connexion dans un délai raisonnable a échoué.";

"OperationCancelledError.errorDescription" = "Opération annulée";
"OperationCancelledError.failureReason" = "Opération annulée à votre demande.";

"OperationTimedOutError.errorDescription" = "Délai de l'opération dépassé";
"OperationTimedOutError.failureReason" = "L'opération n'a pas réussi à se terminer dans un délai raisonnable.";

"UbiquitousSyncNotEnabledError.errorDescription" = "iCloud Sync désactivé";
"UbiquitousSyncNotEnabledError.failureReason" = "iCloud Sync doit être activé pour effectuer cette action.";

"UbiquitousSyncIdentifierDiffersError.errorDescription" = "Non-concordance iCloud Sync";
"UbiquitousSyncIdentifierDiffersError.failureReason" = "Les données stockées dans iCloud semblent appartenir à un utilisateur différent. Il se peut que vous ayez changé d'utilisateur iCloud depuis votre première activation d'iCloud Sync.";

"UbiquitousStoreUnlockableError.errorDescription" = "Synchronisation avec iCloud impossible";
"UbiquitousStoreUnlockableError.failureReason" = "Impossible de déverrouiller les données iCloud, votre phrase secrète a peut-être changé.";
"UbiquitousStoreUnlockableError.recoverySuggestion" = "Si vous avez changé votre phrase secrète sur un autre appareil, mettez-la à jour ici pour utiliser iCloud Sync.";

"UbiquitousStoreUnprotectedError.errorDescription" = "Le stockage d'iCloud n'est pas protégé par une phrase secrète";
"UbiquitousStoreUnprotectedError.failureReason" = "Interruption de la synchronisation iCloud car le stockage n'est pas protégée par une phrase secrète";

"PairingFailedError.errorDescription" = "Appairage échoué";
"PairingFailedError.failureReason" = "Impossible de terminer l'appairage.";

"PairingDeniedError.errorDescription" = "Appairage refusé";
"PairingDeniedError.failureReason" = "Le pair a refusé la demande d'appairage.";

"SyncingFailedError.errorDescription" = "Synchro. échouée";
"SyncingFailedError.failureReason" = "L'opération de synchronisation n'a pas pu être terminé.";

"PersistentStoreLockedError.errorDescription" = "Le stockage est en train d'être utilisé";
"PersistentStoreLockedError.failureReason" = "Réessayer l'opération dans un moment.";

"UnsuportedDocumenTypeError.errorDescription" = "Type de document non supporté";
"UnsuportedDocumenTypeError.failureReason" = "Le document demandé n'est pas supporté.";

"WrongDocumentPassphraseError.errorDescription" = "Mauvaise phrase secrète";
"WrongDocumentPassphraseError.failureReason" = "Impossible d'ouvrir le document avec la phrase secrète fournie.";

/*
 * The %@ will be replaced by another application name. Example:
 * 
 * Failed to communicate with Safari.
*/
"ScriptingBridgeError.errorDescription" = "Communication échouée avec %@";
"ScriptingBridgeError.failureReason" = "Échec de la requête pour que %@ effectue l'opération désirée.";

"CouldNotSaveDocumentError.errorDescription" = "Impossible de sauvegarder le document";
"CouldNotSaveDocumentError.failureReason" = "Une erreur s'est produite lors de la tentative de sauvegarde de votre document.";

"SecureEnclaveNotAvailableError.errorDescription" = "Authentification de l'appareil non disponible";
"SecureEnclaveNotAvailableError.failureReason" = "Votre appareil doit avoir un code d'accès ou Touch iD activé pour utiliser cette fonctionnalité";

"IACError.UnsupportedCallback" = "'%@' n'est pas une action x-callback-url supportée par %@";
"IACError.UnsupportedScheme" = "Aucune application avec le schéma '%@' n'est installée sur cet appareil";

"SyncMissingPremium.errorDescription" = "Synchro. désactivée";
"SyncMissingPremium.failureReason" = "Devenez Premium pour continuer à synchroniser plus de %d éléments";

"ImportMissingPremium.errorDescription" = "L'importation a atteinte la limite d'éléments gratuits";
"ImportMissingPremium.failureReason" = "La version Gratuite est limitée à %d éléments. Veuillez mettre à niveau et importer à nouveau ce fichier.";

